<!DOCTYPE html><html xmlns="http://www.w3.org/1999/xhtml"><head><title>INFRES722 Aplications P2P</title><meta name="generator" content="Hovercraft! 1.0 http://regebro.github.com/hovercraft"></meta><link rel="stylesheet" href="css/hovercraft.css" media="all"></link><link rel="stylesheet" href="css/impressConsole.css" media="all"></link><link rel="stylesheet" href="css/highlight.css" media="all"></link><link rel="stylesheet" href="style.css" media="screen,projection"></link></head><body class="impress-not-supported"><div id="impress" data-transition-duration="1700"><div class="step" step="0" data-x="0" data-y="0"><h1 id="infres722-aplications-p2p">INFRES722 Aplications P2P</h1><p><a href="https://github.com/piotr2b/INFRES722-Aplications-P2P">https://github.com/piotr2b/INFRES722-Aplications-P2P</a></p></div><div class="step" step="1" data-x="1600" data-y="0"><h1 id="sommaire">Sommaire</h1><ul><li>Pourquoi choisir de parler des applications pair &#xE0; pair</li><li>Mod&#xE8;les d'architectures : client-serveur et pair &#xE0; pair</li><li>Atouts du pair &#xE0; pair</li><li>R&#xE9;seau pairs &#xE0; pairs : une superposition</li><li>Quelques applications pair &#xE0; pair</li></ul></div><div class="step" step="2" data-x="3200" data-y="0"><h1 id="modeles-d-architectures">Mod&#xE8;les d'architectures</h1><p>Il existe une grande vari&#xE9;t&#xE9; d'architecture de r&#xE9;seaux possibles :</p><ul><li>Mainframe : l'&#xE9;gr&#xE9;gore</li><li>Pair &#xE0; pair : les fourmis</li><li>Deux niveaux : ma&#xEE;tre et esclave</li><li>Les trois tiers : l'entremetteur</li><li>N niveaux : la sp&#xE9;cialisation</li></ul><div class="notes"><ul><li>Mainframe : terminal passif</li><li>Pair &#xE0; pair : on va le d&#xE9;crire.</li><li>Deux niveaux : un client demande une ressource au serveur qui la fournit &#xE0; partir de ses propres ressources.</li><li>Les trois tiers : pr&#xE9;sentation / m&#xE9;tier / base de donn&#xE9;es.</li><li>N niveaux : on d&#xE9;compose chaque r&#xE9;ponse en plusieurs couches de traitements.</li></ul></div></div><div class="step" step="3" data-x="4800" data-y="0"><h1 id="architecture-client-serveur">Architecture client serveur</h1><p>Client serveur : mod&#xE8;le de r&#xE9;seau informatique dans lequel un agent, qualifi&#xE9; de client, envoie des requ&#xEA;tes ; l'autre ou les autres, qualifi&#xE9;s de serveurs, attendent les requ&#xEA;tes des clients et y r&#xE9;pondent.</p><img src="img/500px-Server-based-network.svg.png" alt="" width="300px" height=""></img></div><div class="step" step="4" data-x="6400" data-y="0"><h1 id="architecture-pair-a-pair">Architecture pair &#xE0; pair</h1><p>Pair &#xE0; pair : mod&#xE8;le de r&#xE9;seau informatique proche du mod&#xE8;le client-serveur mais o&#xF9; chaque client est aussi un serveur.</p><img src="img/500px-P2P-network.svg.png" alt="" width="300px" height=""></img><div class="notes"><ul><li><dl><dt>Client-server:</dt><dd><ul><li>Client: On/off behavior, Service consumer, Issue requests, Do not communicate directly among them, Need to know the server address.</li><li>Server: Always on, Service provider, Receive services, Satisfy requests from many clients, Need a fixed address (or DNS name). Server distributes content to all clients and need to provide the necesarry bandwidth.</li></ul></dd></dl></li><li><dl><dt>Peer to peer paradigm:</dt><dd><ul><li>Runs on end-hosts, On/off behavior, Service providers and consumers, Communicate directly among them, Need to discover other peers, Need to define communication rules, Need to handle peer arrival and departure</li><li>Peers can assist a server using their bandwidth. They are equal, merging role of client an server</li><li>Those network doesn't necessarily needs a server. Most of time they need for bootstrap but not for resource sharing.</li></ul></dd></dl></li></ul></div></div><div class="step" step="5" data-x="8000" data-y="0"><h1 id="une-meilleure-mise-a-l-echelle">Une meilleure mise &#xE0; l'&#xE9;chelle</h1><img src="img/application-layer-jain-53-638.jpg" alt="" width="600px" height=""></img><p>1 serveur ou <em>seeder</em>, N clients ou <em>leechers</em></p><div class="notes"><ul><li>Server distributes content to all clients and need to provide the necesarry bandwidth.</li><li>Peers are equal, merging role of client an server.</li></ul></div></div><div class="step" step="6" data-x="9600" data-y="0"><h1 id="un-reseau-pair-a-pair-une-surcouche">Un r&#xE9;seau pair &#xE0; pair : une surcouche</h1><img src="img/2000px-Network_Overlay.svg.png" alt="" width="600px" height=""></img><p>Un r&#xE9;seau pair &#xE0; pair est un graphe (couvrant) dont les ar&#xEA;tes repr&#xE9;sentent les connexions logiques entre pairs au-dessus de l'infrastructure IP. Sa couverture d&#xE9;pend beaucoup du choix de l'algorithme.</p><div class="notes"><ul><li>Tous les liens logiques ne sont pas forc&#xE9;ment des liens phyisiques ;</li><li>Tous les liens physiques ne sont pas forc&#xE9;ment utilis&#xE9;s ;</li><li>C'est un graphe instable car les pairs ne sont pas fixes ;</li><li>Les voisins d'un n&#x153;ud n'ont pas forc&#xE9;ment ce qu'il demande ou ne veulent pas la partager (incitation au partage) ;</li></ul></div></div><div class="step" step="7" data-x="11200" data-y="0"><h1 id="vulnerabilites">Vuln&#xE9;rabilit&#xE9;s</h1><ul><li>Empoisonnement : faire passer des fichiers illisibles ou corrompus pour sains et valides ;</li><li>Harc&#xE8;lement : envoyer n'importe quoi aux autres pairs ;</li><li>D&#xE9;ni de service : infecter les pairs pour qu'ils bloquent les requ&#xEA;tes ;</li><li>Braquage : demander &#xE0; t&#xE9;l&#xE9;charger toutes les donn&#xE9;es disponibles sur le r&#xE9;seau sans rien donner en &#xE9;change ;</li><li>Virus : r&#xE9;pendre un logiciel pair &#xE0; pair lui-m&#xEA;me programm&#xE9; pour espionner l'utilisation de l'utilisateur ;</li><li>Filtrage : un pare-feu bloque les ports utilis&#xE9;s par le r&#xE9;seau ;</li><li>Ing&#xE9;ni&#xE9;rie sociale : d&#xE9;couvrir l'identit&#xE9; des utilisateurs puis les harceler, si besoin en les trainant en justice.</li></ul></div><div class="step" step="8" data-x="12800" data-y="0"><h1 id="plusieurs-generations-de-reseaux">Plusieurs g&#xE9;n&#xE9;rations de r&#xE9;seaux</h1><p>Le jeu du chat et de la souris devant les tribunaux favorise malgr&#xE9; tout l'innovation qui passe principalement par un changement de structure.</p><ul><li>Premi&#xE8;re g&#xE9;n&#xE9;ration : un r&#xE9;pertoire central est utilis&#xE9; pour ins&#xE9;rer de nouveaux n&#x153;uds et centraliser les informations ;</li><li>Deuxi&#xE8;me g&#xE9;n&#xE9;ration : utilisation d'un r&#xE9;pertoire r&#xE9;parti donc d&#xE9;centralis&#xE9; (diffusion de requ&#xEA;tes) ;</li><li>Troisi&#xE8;me g&#xE9;n&#xE9;ration : le r&#xE9;pertoire est encore mieux dilu&#xE9; et plus personne ne sait qui sait quoi grace &#xE0; des algorithmes de hachage distribu&#xE9;. On assiste aussi &#xE0; la formation de communaut&#xE9; de partage ou au partage incognito.</li></ul><div class="notes"><ul><li>1&#xE8;re : Napster</li><li>2&#xE8;me : Gnutella (&#xE9;volu&#xE9;) and Kazaa</li><li><dl><dt>3&#xE8;me :</dt><dd><ul><li>Metanet, WASTE, MUTE</li><li>GNUnet, Entropy, Freenet</li></ul></dd></dl></li></ul></div></div><div class="step" step="9" data-x="14400" data-y="0"><img src="img/napster.jpg" alt="" width="" height="200px"></img><img src="img/gnutella_large.jpg" alt="" width="" height="200px"></img><img src="img/Gnutella-Logo-Large.png" alt="" width="" height="200px"></img><img src="img/Kazaa.jpg" alt="" width="" height="200px"></img><img src="img/logo_mute.gif" alt="" width="" height="200px"></img><img src="img/500px-GNUnet_logo.svg.png" alt="" width="" height="200px"></img><img src="img/image.num1285870029.of.world-lolo.com.jpg" alt="" width="" height="200px"></img><p>Mute et d'autres&#x2026;</p></div><div class="step" step="10" data-x="16000" data-y="0"><ol><li>Non structur&#xE9;e : les pairs sont connect&#xE9;s au hasard et inondent le r&#xE9;seau de leur requ&#xEA;tes. Ce r&#xE9;seau est tr&#xE8;s r&#xE9;sistant mais utilise pour lui-m&#xEA;me beaucoup de bande passante donc passe mal &#xE0; l'&#xE9;chelle.</li><li>Structur&#xE9;e : parmi les pairs en est choisi judicieusement un certain nombre selon certains crit&#xE8;res qui seuls ont le droit d'inonder le r&#xE9;seau de requ&#xEA;tes. Les pairs simples se tournent vers eux. Un tel r&#xE9;seau est moins r&#xE9;sistant face &#xE0; la perte d'un n&#x153;ud principal mais les requ&#xEA;tes sont plus &#xE9;conomiques et le r&#xE9;seau passe mieux &#xE0; l'&#xE9;chelle.</li><li>Hi&#xE9;rarchique : les pairs s'assemblent de fa&#xE7;on &#xE0; former une structure g&#xE9;om&#xE9;trique, par exemple un hypercube. L'&#xE9;mission de requ&#xEA;te est alors intelligente et cibl&#xE9;e mais la p&#xE9;rennit&#xE9; de la g&#xE9;om&#xE9;trie est difficile a assurer.</li></ol></div><div class="step" step="11" data-x="17600" data-y="0"><h1 id="quelques-applications-pair-a-pair">Quelques applications pair &#xE0; pair</h1><ul><li>apt-p2p, DebTorrent ;</li><li>R&#xE9;seau anonyme i2p ;</li><li>Skype.</li></ul></div><div class="step" step="12" data-x="19200" data-y="0"><h1 id="apt-p2p-debtorrent">apt-p2p, DebTorrent</h1><img src="img/apt-p2p.png" alt="" width="" height="400px"></img></div><div class="step" step="13" data-x="20800" data-y="0"><h1 id="reseau-anonyme-i2p">R&#xE9;seau anonyme i2p</h1><img src="img/net.png" alt="" width="" height="300px"></img><img src="img/endToEndEncryption.png" alt="" width="" height="300px"></img><div class="notes"><ul><li>The network itself is strictly message-based (like IP), but there is a library available to allow reliable streaming communication on top of it (similar to TCP, although from version 0.6 there is a new UDP-based SSU transport). All communication is end-to-end encrypted (in total there are four layers of encryption used when sending a message), and even the end points ("destinations") are cryptographic identifiers (essentially a pair of public keys), so that neither sender nor recipient of a message need to reveal their IP address to the other side or to third-party observers.</li><li>Although many of the developers had been a part of the Invisible IRC Project (IIP)[8] and Freenet communities, there are significant differences between their designs and concepts. IIP was an anonymous centralized IRC server. Freenet is a censorship-resistant distributed data store. I2P is an anonymous peer-to-peer distributed communication layer designed to run any traditional internet service (e.g. Usenet, email, IRC, file sharing, Web hosting and HTTP, Telnet), as well as more traditional distributed applications (e.g. a distributed data store, a web proxy network using Squid, or DNS).</li><li>Many developers of I2P are known only under pseudonyms. While the previous main developer, jrandom, is currently on hiatus, others, such as zzz, killyourtv and Complication have continued to lead development efforts, and are assisted by numerous contributors.[9]</li></ul></div></div><div class="step" step="14" data-x="22400" data-y="0"><h1 id="skype">Skype</h1><img src="img/skype.png" alt="" width="" height="500px"></img></div><div class="step" step="15" data-x="24000" data-y="0"><h1 id="un-logiciel-en-plein-essor">Un logiciel en plein essor</h1><img src="img/skypegrowth.jpg" alt="" width="500px" height=""></img><img src="img/news20130213-1.gif" alt="" width="500px" height=""></img><div class="notes"><ul><li>Architecture pair &#xE0; pair</li><li>Donn&#xE9;es de service : voix, vid&#xE9;o, partage de bureau&#x2026;</li><li>Donn&#xE9;es de signalisation : identification, rechercher des amis&#x2026;</li><li>Logiciel privateur</li></ul></div></div><div class="step" step="16" data-x="25600" data-y="0"><p>?</p></div></div><div id="hovercraft-help"><table><tr><th>Space</th><td>Forward</td></tr><tr><th>Left, Down, Page Down</th><td>Next slide</td></tr><tr><th>Right, Up, Page Up</th><td>Previous slide</td></tr><tr><th>P</th><td>Open presenter console</td></tr><tr><th>H</th><td>Toggle this help</td></tr></table></div><script type="text/javascript" src="js/impress.js"></script><script type="text/javascript" src="js/impressConsole.js"></script><script type="text/javascript" src="js/hovercraft.js"></script></body></html>
